In [2]:
import pandas as pd
import numpy as np

In [3]:
index = ['a', 'x', 'c', '2', 'e']
values = [1, 4, 9, 6, 7]

series = pd.Series(values, index=index)
print(series)

a    1
x    4
c    9
2    6
e    7
dtype: int64

In [4]:
index=["Bilal","Ayesha","Hadia"]
value=[42,38,39]
Series=pd.Series(value,index=index)
print(Series)

Bilal     42
Ayesha    38
Hadia     39
dtype: int64

In [5]:
df=pd.DataFrame({
    "day":["1/1/2017","1/2/2017","1/3/2017","1/4/2017","1/5/2017","1/6/2017"],
    "temprature":[32,35,28,24,32,31],
    "windspeed":[6,7,2,7,4,2],
    "evevt":["Rain","Sunny","Snow","Snow","Rain","Sunny"]
})
df

        day  temprature  windspeed  evevt
0  1/1/2017          32          6   Rain
1  1/2/2017          35          7  Sunny
2  1/3/2017          28          2   Snow
3  1/4/2017          24          7   Snow
4  1/5/2017          32          4   Rain
5  1/6/2017          31          2  Sunny

In [6]:
df.index=('a','b','c','d','e','f')
df

        day  temprature  windspeed  evevt
a  1/1/2017          32          6   Rain
b  1/2/2017          35          7  Sunny
c  1/3/2017          28          2   Snow
d  1/4/2017          24          7   Snow
e  1/5/2017          32          4   Rain
f  1/6/2017          31          2  Sunny

In [7]:
tem_mean=df.temprature.mean()
print("Mean:",tem_mean)

Mean: 30.333333333333332

In [8]:
tem_max=df.temprature.max()
print("Maximum_tem:",tem_max)

Maximum_tem: 35

In [9]:
tem_min=df.temprature.min()
print("Minimum_tem:",tem_min)

Minimum_tem: 24

In [10]:
df1=pd.read_csv("people.csv")

In [17]:
# Importing CSV and specifying columns to import
import_columns=["First Name", "Sex", "Email", "Phone", "Job Title"]
df=pd.read_csv('people.csv',usecols=import_columns,skiprows=[1,5])
# Setting 'Sex' and 'Job Title' as index columns
df.set_index(["Sex", "Job Title"],inplace=True)
# Exporting the DataFrame to a new CSV file
df.to_csv("NewPeople.csv")
df

                                First Name                       Email  \
Sex    Job Title
Female Phytotherapist              Phillip       bethany14@example.com
Male   Homeopath                  Kristine       bthompson@example.com
       Market researcher           Yesenia   kaitlinkaiser@example.com
       Waste management officer       Erin         tconner@example.org
Female Intelligence analyst      Katherine     conniecowan@example.com
...                                    ...                         ...
       Software engineer            Dennis         bmartin@example.org
       Barrister                     Steve       latasha46@example.net
Male   Police officer               Wesley        regina11@example.org
Female Broadcast journalist         Summer  alexiscantrell@example.org
Male   IT sales professional        Mariah       pcopeland@example.org

                                                 Phone
Sex    Job Title
Female Phytotherapist                214.112.6044x4913
Male   Homeopath                          277.609.7938
       Market researcher                  584.094.6111
       Waste management officer  001-171-649-9856x5553
Female Intelligence analyst      +1-773-151-6685x49162
...                                                ...
       Software engineer          001-095-524-2112x257
       Barrister                      001-865-478-5157
Male   Police officer               995-542-3004x76800
Female Broadcast journalist       001-273-685-6932x092
Male   IT sales professional       (341)594-6554x44657

[98 rows x 3 columns]

Q.7: Import excel sheet ‘SampleWork.xlsx’ in the given folder. Keep in mind the following instructions:
Import sheet 1
Import only first and last column from sheet 1
Skip row 2 while importing the sheet
Set row 2 as header
export as new sheet.

In [24]:
df=pd.read_excel("SampleWork.xlsx",sheet_name=1,usecols=[0,-1],skiprows=[1],header=1)
df
# Export the DataFrame to a new Excel file with a new sheet
df.to_excel('NewSampleWork.xlsx', index=False)

Q.8

In [50]:
AICP_DF=pd.DataFrame({
    'Name':['Sonia','Bilal','Hifza','kabie','Jazam'],
    'Age':[27,24,22,32,23],
    'Address':['Lahore','Karachi','Sialkot','Peshawar','lhr'],
    'Qualification':['Msc','MA','MCA','Phd','bsc']
})
#hifza_row=AICP_DF.loc['Hifza']

AICP_DF
df1=AICP_DF[['Qualification','Name']]
AICP_DF['Height']=[5.1, 6.2, 5.1, 5.2,5.1]
AICP_DF.set_index("Name")
AICP_DF

    Name  Age   Address Qualification  Height
0  Sonia   27    Lahore           Msc     5.1
1  Bilal   24   Karachi            MA     6.2
2  Hifza   22   Sialkot           MCA     5.1
3  kabie   32  Peshawar           Phd     5.2
4  Jazam   23       lhr           bsc     5.1

In [62]:
row_hifza = AICP_DF[AICP_DF['Name'] == 'Hifza']
print(row_hifza)

    Name  Age  Address Qualification  Height
2  Hifza   22  Sialkot           MCA     5.1

In [65]:
# Drop row with index “Bilal”
AICP_DF_dropped = AICP_DF[AICP_DF['Name'] != 'Bilal']
print("DataFrame after dropping row with index 'Bilal':")
print(AICP_DF_dropped)

DataFrame after dropping row with index 'Bilal':
    Name  Age   Address Qualification  Height
0  Sonia   27    Lahore           Msc     5.1
2  Hifza   22   Sialkot           MCA     5.1
3  kabie   32  Peshawar           Phd     5.2
4  Jazam   23       lhr           bsc     5.1

In [59]:
row_index_3=AICP_DF.iloc[3]
print(row_index_3)

Name                kabie
Age                    32
Address          Peshawar
Qualification         Phd
Height                5.2
Name: 3, dtype: object

In [64]:
# Drop row with index “Bilal”
AICP_DF_dropped = AICP_DF[AICP_DF['Name'] != 'Bilal']
print("DataFrame after dropping row with index 'Bilal':")
print(AICP_DF_dropped)

DataFrame after dropping row with index 'Bilal':
    Name  Age   Address Qualification  Height
0  Sonia   27    Lahore           Msc     5.1
2  Hifza   22   Sialkot           MCA     5.1
3  kabie   32  Peshawar           Phd     5.2
4  Jazam   23       lhr           bsc     5.1